---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctPressureDropData.HydraulicDiameter
source: html/bcb8a3ff-b181-d37b-c165-b36cb9fad32e.htm
---
# Autodesk.Revit.DB.Mechanical.DuctPressureDropData.HydraulicDiameter Property

The hydraulic diameter of the duct. Units: (ft).

## Syntax (C#)
```csharp
public double HydraulicDiameter { get; set; }
```